arc> 25
25
arc> "foo"
"foo"

arc> (+ 1 2)
3

arc> (+ (+ 1 2) (+ 3 (+ 4 5)))
15

arc> (+)
0
arc> (+ 1)
1
arc> (+ 1 2)
3
arc> (+ 1 2 3)
6

arc> (= foo 13)
13
arc> foo
13


